# Задача: “Секретное слово”
# Создай цикл while, который спрашивает у пользователя слово.
# Если введено "Python", программа печатает "Молодец!" и завершается.

user_world = input('Please input a word: ')
secret_world = 'Python'
while secret_world.lower() not in user_world.lower():
    user_world = input('Please input a word: ')
else:
    print('Well done')


# Что можно улучшить:
# Логичнее проверять равенство, а не “вхождение” (in),
# иначе если пользователь введёт "ILovePython", программа тоже завершится.
# Если ты хотел именно полное совпадение — стоит заменить условие на !=.
# else: после while — здесь не обязателен.
# Он сработает только если цикл завершился без break, но ты не используешь break.
# Проще сделать печать сразу после цикла.
# 💡 Оптимальный вариант:

secret_word = 'Python'

while True:
    user_word = input('Please input a word: ')
    if user_word.lower() == secret_word.lower():
        print('Well done!')
        break